app/controllers/v1/stories_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 11]]
---
    def show
      @story = Story.find(params[:id])

INSERT INTO "stories" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test Title"], ["body", "blah blah blah blah blah blah blah"], ["user_id", 3], ["created_at", "2015-08-30 03:38:38.497596"], ["updated_at", "2015-08-30 03:38:38.497596"]]
---
    def create
      @story = Story.new(story_params)

      if @story.save